In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
df = pd.read_csv("salaries.csv")
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,EN,FT,Azure Data Engineer,100000,USD,100000,MU,0,MU,S
1,2020,EN,CT,Staff Data Analyst,60000,CAD,44753,CA,50,CA,L
2,2020,SE,FT,Staff Data Scientist,164000,USD,164000,US,50,US,M
3,2020,EN,FT,Data Analyst,42000,EUR,47899,DE,0,DE,L
4,2020,EX,FT,Data Scientist,300000,USD,300000,US,100,US,L

In [9]:
df.drop(columns=["salary", "salary_currency"], inplace=True)
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,EN,FT,Azure Data Engineer,100000,MU,0,MU,S
1,2020,EN,CT,Staff Data Analyst,44753,CA,50,CA,L
2,2020,SE,FT,Staff Data Scientist,164000,US,50,US,M
3,2020,EN,FT,Data Analyst,47899,DE,0,DE,L
4,2020,EX,FT,Data Scientist,300000,US,100,US,L

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37234 entries, 0 to 37233
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           37234 non-null  int64
 1   experience_level    37234 non-null  object
 2   employment_type     37234 non-null  object
 3   job_title           37234 non-null  object
 4   salary_in_usd       37234 non-null  int64
 5   employee_residence  37234 non-null  object
 6   remote_ratio        37234 non-null  int64
 7   company_location    37234 non-null  object
 8   company_size        37234 non-null  object
dtypes: int64(3), object(6)
memory usage: 2.6+ MB

In [12]:
df.describe(include="all")

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
count,37234.000000,37234,37234,37234,37234.000000,37234,37234.000000,37234,37234
unique,NaN,4,4,215,NaN,91,NaN,81,3
top,NaN,SE,FT,Data Scientist,NaN,US,NaN,US,M
freq,NaN,22523,37121,7448,NaN,33755,NaN,33806,35583
mean,2023.656443,NaN,NaN,NaN,160540.603105,NaN,23.197884,NaN,NaN
std,0.611469,NaN,NaN,NaN,72679.876280,NaN,42.005217,NaN,NaN
min,2020.000000,NaN,NaN,NaN,15000.000000,NaN,0.000000,NaN,NaN
25%,2023.000000,NaN,NaN,NaN,110000.000000,NaN,0.000000,NaN,NaN
50%,2024.000000,NaN,NaN,NaN,150000.000000,NaN,0.000000,NaN,NaN
75%,2024.000000,NaN,NaN,NaN,200000.000000,NaN,0.000000,NaN,NaN
max,2024.000000,NaN,NaN,NaN,800000.000000,NaN,100.000000,NaN,NaN